# -*- org-src-preserve-indentation: t; org-edit-src-content: 0; -*-
#+TITLE: Supplementary V: Python Snippets
#+AUTHOR: Rohit Goswami
#+EMAIL: rog32@hi.is
# This should not be altered
#+OPTIONS: toc:nil title:nil todo:nil
# I need the footnotes to be inlined
#+STARTUP: fninline

** Water stretch tests
#+begin_src python :results output
bond_angle_rad = 104.5 * np.pi / 180.0
pos_x1 = [
    [0.0, 0.0, 0.0],
    [0.9, 0.0, 0.0],
    [1.1 * np.cos(bond_angle_rad), 1.1 * np.sin(bond_angle_rad), 0.0],
]
x1 = Atoms("OH2", positions=pos_x1)
print("\nConfiguration x1 (Reference):")
print(x1.get_positions())
print(
    f"Distances: r(0,1)={x1.get_distance(0, 1):.4f}, r(0,2)={x1.get_distance(0, 2):.4f}"
)
#+end_src

#+RESULTS[8c752db27adccc4920b0b2e0d393b6c35d9bd44b]:
:
: Configuration x1 (Reference):
: [[ 0.         0.         0.       ]
:  [ 0.9        0.         0.       ]
:  [-0.275418   1.0649624  0.       ]]
: Distances: r(0,1)=0.9000, r(0,2)=1.1000

#+begin_src python :results output
pos_x2 = [
    [0.0, 0.0, 0.0],
    [0.95, 0.0, 0.0],
    [1.05 * np.cos(bond_angle_rad), 1.05 * np.sin(bond_angle_rad), 0.0],
]
x2 = Atoms("OH2", positions=pos_x2)
print("\nConfiguration x2 (Perturbed):")
print(x2.get_positions())
print(
    f"Distances: r(0,1)={x2.get_distance(0, 1):.4f}, r(0,2)={x2.get_distance(0, 2):.4f}"
)
#+end_src

#+RESULTS[7cd6fcbcaf84673ce3e062c5e0bfffc9c8a477e1]:
:
: Configuration x2 (Perturbed):
: [[ 0.          0.          0.        ]
:  [ 0.95        0.          0.        ]
:  [-0.262899    1.01655502  0.        ]]
: Distances: r(0,1)=0.9500, r(0,2)=1.0500

#+begin_src python :results output
pos_x2_swapped = [x2.positions[0], x2.positions[2], x2.positions[1]]
x2_swapped = Atoms("OH2", positions=pos_x2_swapped)
print("\nConfiguration x2_swapped (Labels of H atoms swapped):")
print(x2_swapped.get_positions())
print(
    f"Distances: r(0,1)={x2_swapped.get_distance(0, 1):.4f}, r(0,2)={x2_swapped.get_distance(0, 2):.4f}"
)
#+end_src

#+RESULTS[35bdbb2d6369e1a05643d6e3bf478bff8f9d5a71]:
:
: Configuration x2_swapped (Labels of H atoms swapped):
: [[ 0.          0.          0.        ]
:  [-0.262899    1.01655502  0.        ]
:  [ 0.95        0.          0.        ]]
: Distances: r(0,1)=1.0500, r(0,2)=0.9500

#+begin_src python :results output
# Calculate all required distances
dist_1_2_log = dist_max1dlog(x1, x2)
dist_1_2swapped_log = dist_max1dlog(x1, x2_swapped)
dist_2_2swapped_log = dist_max1dlog(x2, x2_swapped)

dist_1_2_emd = dist_emd(x1, x2)
dist_1_2swapped_emd = dist_emd(x1, x2_swapped)
dist_2_2swapped_emd = dist_emd(x2, x2_swapped)

# Print formatted results
print("\n1. 1D Max Log Distance (Non-Invariant)")
print(f"   Distance D(x1, x2)         = {dist_1_2_log:.8f}")
print(f"   Distance D(x1, x2_swapped) = {dist_1_2swapped_log:.8f}")

print("\n2. Earth Mover's Distance (Invariant)")
print(f"   Distance D(x1, x2)         = {dist_1_2_emd:.8f}")
print(f"   Distance D(x1, x2_swapped) = {dist_1_2swapped_emd:.8f}")

print("\n\n--- Conclusion ---")
print(
    "The results show that D(x1, x2) and D(x1, x2_swapped) produce different values"
)
print("for the 1D Max Log metric, proving it is **not permutationally invariant**.")
print("\nIn contrast, the EMD metric gives identical values, proving it correctly")
print("handles permutations and recognizes physical symmetry.")

print(
    "\nBonus Check: Distance between two geometrically identical configurations (x2 vs x2_swapped)"
)
print(f"   1D Max Log : {dist_2_2swapped_log:.8f} (Incorrectly non-zero)")
print(f"   EMD        : {dist_2_2swapped_emd:.8f} (Correctly zero)")
#+end_src

#+RESULTS[ea693f3e0ca8c4437ba49f59c89405704f7db858]:
#+begin_example

1. 1D Max Log Distance (Non-Invariant)
   Distance D(x1, x2)         = 0.05406722
   Distance D(x1, x2_swapped) = 0.15415068

2. Earth Mover's Distance (Invariant)
   Distance D(x1, x2)         = 0.05000000
   Distance D(x1, x2_swapped) = 0.05000000


--- Conclusion ---
The results show that D(x1, x2) and D(x1, x2_swapped) produce different values
for the 1D Max Log metric, proving it is **not permutationally invariant**.

In contrast, the EMD metric gives identical values, proving it correctly
handles permutations and recognizes physical symmetry.

Bonus Check: Distance between two geometrically identical configurations (x2 vs x2_swapped)
   1D Max Log : 0.10008346 (Incorrectly non-zero)
   EMD        : 0.00000000 (Correctly zero)
#+end_example

